//
//
//
//
//
//
// to make easy to work with picture in picture tutorial
//
//
//
//
//
//
//
//

In [1]:
import pandas as pd
import numpy as np

In [2]:
import pandas as pd
olympic_series_participation = pd.Series([205,204,201,200,197], 
                                         index= [2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['Lodon', 'Beijig','Athens', 'Sydney', 'Atlanta'],
                                   index= [2012,2008,2004,2000,1996])
df_olympic_series = pd.DataFrame({'No. of participanting Countries': olympic_series_participation,
                                  'Host Cities': olympic_series_country})

In [3]:
df_olympic_series

      No. of participanting Countries Host Cities
2012                              205       Lodon
2008                              204      Beijig
2004                              201      Athens
2000                              200      Sydney
1996                              197     Atlanta

In [4]:
df_olympic_series.describe

<bound method NDFrame.describe of       No. of participanting Countries Host Cities
2012                              205       Lodon
2008                              204      Beijig
2004                              201      Athens
2000                              200      Sydney
1996                              197     Atlanta>

In [5]:
#head method - eg: top 2 record

df_olympic_series.head(2)

      No. of participanting Countries Host Cities
2012                              205       Lodon
2008                              204      Beijig

In [6]:
#tail method - eg: top 3
df_olympic_series.tail(3)

      No. of participanting Countries Host Cities
2004                              201      Athens
2000                              200      Sydney
1996                              197     Atlanta

In [7]:
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [8]:
df_olympic_series.columns

Index(['No. of participanting Countries', 'Host Cities'], dtype='object')

In [9]:
df_olympic_series['Host Cities']

2012      Lodon
2008     Beijig
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [10]:
df_olympic_series['No. of participanting Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of participanting Countries, dtype: int64

In [11]:
#label-location based access by label
df_olympic_series.loc[2012]

No. of participanting Countries      205
Host Cities                        Lodon
Name: 2012, dtype: object

In [12]:
#integer-location based indexing by position
df_olympic_series.iloc[0:2]

      No. of participanting Countries Host Cities
2012                              205       Lodon
2008                              204      Beijig

In [13]:
#integer-location based data selection by index value
df_olympic_series.iat[3,0]

200

In [14]:
df_olympic_series[df_olympic_series['No. of participanting Countries']>200]

      No. of participanting Countries Host Cities
2012                              205       Lodon
2008                              204      Beijig
2004                              201      Athens

In [15]:
df_student_math = pd.DataFrame({'Student':['Tom','Jack','Dan','Ram','Jeff','David'],
                                'ID':[10,56,31,85,9,22]
                               })

In [16]:
df_student_science = pd.DataFrame({'Student':['Tom','Ram','David'],
                                  'ID':[10,12,22]
                                  })

In [17]:
pd.merge(df_student_math,df_student_science)

  Student  ID
0     Tom  10
1   David  22

In [18]:
pd.merge(df_student_math,df_student_science,on='Student')

  Student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [19]:
pd.merge(df_student_math,df_student_science,on='ID',how='left').fillna('X')

  Student_x  ID Student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [20]:
#concatenate dataframe
pd.concat([df_student_math,df_student_science],ignore_index=True)

  Student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [21]:
df_student_survey_data = pd.DataFrame({'Student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                                      'ID':[10,56,10,85,9,56]
                                      })

In [22]:
df_student_survey_data

  Student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [23]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [24]:
df_student_survey_data.drop_duplicates('Student')

  Student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [25]:
df_student_survey_data.drop_duplicates('ID')

  Student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

# sql operation - sqlite3  library

In [26]:
import sqlite3

In [27]:
#create SQL table
create_table= """
CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science REAL
);"""

In [28]:
#execute the SQL statement
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

In [29]:
#prepare a SQL query
SQL_query = executeSQL.execute('select * from student_score')

In [30]:
#fetch result from the SQLlite database
resulset = SQL_query.fetchall()

In [31]:
#view result (empty data)
resulset

[]